app/controllers/links_controller.rb

SELECT "links".* FROM "links" ORDER BY position
SELECT "pages".* FROM "pages"
---
  def index
    @links = Link.order("position")
    @link = Link.find(params[:id]) if params[:id]
    @link = Link.new if @link.nil?
    @pages = Page.all

INSERT INTO "links" ("created_at", "page_id", "parent", "position", "title", "updated_at") VALUES ('2010-08-19 01:07:09.036677', 29, NULL, 1, 'Second', '2010-08-19 01:07:09.036677') RETURNING "id"
SELECT "links".* FROM "links" WHERE (parent_id = 4) ORDER BY position DESC LIMIT 1
---
  def create
    @link = Link.new(params[:link])
    if @link.save
      flash[:notice] = "Link created successfully"
    end
    @links = Link.all

SELECT "links".* FROM "links" WHERE ("links"."id" = 2) LIMIT 1
DELETE FROM "links" WHERE ("links"."id" = 2)
SELECT "links".* FROM "links"
---
  def destroy
    @link = Link.find(params[:id])
    if @link.destroy
      @links = Link.all

SELECT "links".* FROM "links"
UPDATE "links" SET "position" = 2, "updated_at" = '2010-08-19 01:09:37.683353' WHERE ("links"."id" = 4)
---
  def sort
    @links = Link.all
    @links.each do |link|
      link.position = params['link'].index(link.id.to_s) + 1
      link.save