app/controllers/links_controller.rb

  def index
    @links = Link.where(parent_id: nil).order("position")
---
SELECT "links".* FROM "links" WHERE ("links"."parent_id" IS NULL) ORDER BY position