app/controllers/pages_controller.rb

  def index
    @pages = Page.all

    if params[:id]
      @page = Page.find(params[:id]) if params[:id]
---
SELECT "pages".* FROM "pages"
SELECT "pages".* FROM "pages" WHERE ("pages"."id" = 5) LIMIT 1

  def create
    @page = Page.new(params[:page])
    if @page.save
      @pages = Page.all
---
INSERT INTO "pages" ("body", "created_at", "meta", "title", "updated_at", "visible") VALUES ('ldfjlfj', '2010-08-17 22:51:49.048889', NULL, 'Test Page', '2010-08-17 22:51:49.048889', NULL) RETURNING "id"
SELECT "pages".* FROM "pages"

  def update
    @page = Page.find(params[:id])
    if @page.update_attributes(params[:page])
      flash[:notice] = "Page updated successfully."
      @pages = Page.all
---
SELECT "pages".* FROM "pages" WHERE ("pages"."id" = 3) LIMIT 1
UPDATE "pages" SET "title" = 'Test Page 5', "updated_at" = '2010-08-18 22:19:49.825206' WHERE ("pages"."id" = 3)
SELECT "pages".* FROM "pages"

  def destroy
    @page = Page.find(params[:id])
    if @page.destroy
      @pages = Page.all
---
SELECT "pages".* FROM "pages" WHERE ("pages"."id" = 1) LIMIT 1
DELETE FROM "pages" WHERE ("pages"."id" = 1)
SELECT "pages".* FROM "pages"